Tekla Open API Reference for Tekla Structures 2025
Events.ModelSaveInfoDelegate Delegate
 The delegate to use for model save with context information.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ModelSaveInfoDelegate(
	string ModelSaveInfo
)
Public Delegate Sub ModelSaveInfoDelegate (
	ModelSaveInfo As String
)
Parameters
ModelSaveInfo
Type: System.String
See Also
Reference
Tekla.Structures.Model Namespace